# ProfileContainsNoLoops Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ProfileContainsNoLoops Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Profile type '[Family Symbol]' contains no loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProfileContainsNoLoops { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileContainsNoLoops As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProfileContainsNoLoops {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace